{
  "id": 4,
  "title": "Technical Security Training",
  "description": "Comprehensive technical security training for ClearTriage's technical team covering cloud security, secure development, monitoring, incident response, recovery, and information spillage procedures.",
  "sections": [
    {
      "id": "a",
      "title": "Cloud Security Administration",
      "description": "AWS security principles, monitoring tools, configuration management, and credential security for technical staff"
    },
    {
      "id": "b",
      "title": "Secure Development Practices",
      "description": "OWASP guidelines, input validation, secrets management, and supply chain security including anti-counterfeit measures"
    },
    {
      "id": "c",
      "title": "Security Monitoring and Response Essentials",
      "description": "Identifying security events, evidence preservation, vulnerability management, and incident communication protocols"
    },
    {
      "id": "d",
      "title": "Advanced Incident Response",
      "description": "Detection infrastructure, common attack vectors, containment strategies, and eradication procedures for incident response team"
    },
    {
      "id": "e",
      "title": "Technical Recovery Procedures",
      "description": "Recovery from backups, technical coordination, and practical runbooks for system restoration"
    },
    {
      "id": "f",
      "title": "Technical Spillage Response",
      "description": "Technical procedures for identifying, containing, and eradicating information spillage incidents"
    }
  ],
  "requiredForMembers": ["Pete", "Savvy", "Braden", "ScaleSec"],
  "specialRequirements": {
    "b": ["Pete", "Savvy", "Braden"],
    "c": ["Pete", "Savvy", "Braden", "Dave", "ScaleSec"],
    "d": ["Pete", "Savvy", "ScaleSec"],
    "e": ["Pete", "Savvy"],
    "f": ["Pete", "Savvy", "Braden"]
  },
  "estimatedDuration": "3 hours",
  "lastUpdated": "2025-01-30",
  "complianceControls": [
    "AT-3",
    "IR-2",
    "IR-9",
    "SR-11(1)"
  ],
  "notes": "Role-based technical training with specific sections restricted to relevant personnel. Section b includes critical anti-counterfeit training for SR-11(1) compliance."
}